## Vector Game

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_excel('./Vector_Race_results.xlsx')

In [5]:
df.head()

,Jacob x,Jacob y,Unnamed: 2,Christian x,Christian y,Unnamed: 5,Mia x,Mia y
0,0,0,NaN,0.0,0.0,NaN,0,0
1,1,1,NaN,1.0,1.0,NaN,0,1
2,1,2,NaN,1.0,2.0,NaN,0,1
3,1,3,NaN,2.0,3.0,NaN,0,2
4,2,3,NaN,1.0,3.0,NaN,1,3

In [6]:
df.reset_index(drop=True, inplace=True)

In [7]:
df1 = df.iloc[:,:2]

In [8]:
df1

    Jacob x  Jacob y
0         0        0
1         1        1
2         1        2
3         1        3
4         2        3
5         3        4
6         2        3
7         1        1
8         1       -1
9         2       -2
10        3       -3
11        2       -3
12        1       -3
13        0       -2
14       -1       -1
15       -2       -1
16       -3       -1
17       -4       -1
18       -5        0
19        0        0

In [9]:
df2 = df.iloc[:,3:5]
df2 = df2.drop(19)
df2

    Christian x  Christian y
0           0.0          0.0
1           1.0          1.0
2           1.0          2.0
3           2.0          3.0
4           1.0          3.0
5           2.0          3.0
6           2.0          2.0
7           2.0          1.0
8           2.0          0.0
9           2.0         -1.0
10          1.0         -2.0
11          0.0         -3.0
12         -1.0         -4.0
13         -2.0         -3.0
14         -2.0         -2.0
15         -3.0         -1.0
16         -4.0          0.0
17         -3.0         -1.0
18          0.0          0.0

In [10]:
df3 = df.iloc[:,6:8]
df3

    Mia x  Mia y
0       0      0
1       0      1
2       0      1
3       0      2
4       1      3
5       2      3
6       2      2
7       3      1
8       2      0
9       1     -1
10      1     -2
11      0     -3
12      0     -3
13     -1     -3
14     -2     -2
15     -3     -1
16     -4      0
17     -4     -1
18     -3     -1
19      0      0

In [38]:
from typing import List 
Vector = List[float]

In [12]:
def dist(v1:Vector, v2:Vector) ->Vector:
    return [xi+yi for xi, yi in zip(v1, v2)]

In [40]:
p1 = dist(df1['Jacob x'], df1['Jacob y'])
sum(p1)

4

In [14]:
p2 = dist(df2['Christian x'], df2['Christian y'])
sum(p2)

-1.0

In [15]:
p3 = dist(df3['Mia x'], df3['Mia y'])
sum(p3)

-9

In [16]:
def scal(c:float, v:Vector)->Vector:
    return[c*vi for vi in v]

In [17]:
p15 = scal(5, p1)
p15

[0,
 10,
 15,
 20,
 25,
 35,
 25,
 10,
 0,
 0,
 0,
 -5,
 -10,
 -10,
 -10,
 -15,
 -20,
 -25,
 -25,
 0]

In [18]:
def dotp(v1:Vector, v2:Vector)-> float:
    return sum(v1i*v2i for v1i, v2i in zip(v1, v2))

In [19]:
m = dotp(p1, p2)
int(m)

193

In [20]:
def sqsum(v:Vector)->float:
    return (dotp(v, v))

In [21]:
ps1 = sqsum(p1)
ps1

220

In [22]:
import math
def magnit(v:Vector)-> float:
    return math.sqrt(sqsum(v))

In [131]:
def mag(v:Vector)-> float:
    return math.sqrt(sum(v1i*v2i for v1i, v2i in zip(v, v)))

In [139]:
def unit(v:Vector)-> np.array:
    return np.array([vi/mag(v) for vi in v])

In [157]:
def rot90(v:Vector) -> np.array:
    v.reverse()
    return np.array([v[0]*(-1),v[1]])

In [158]:
def scal(c:float, v:Vector)->Vector:
    return[c*vi for vi in v]

In [176]:
a = [3,2]
b = [8,7]
c = [1,5]

In [177]:
def calvector(v1:Vector, v2:Vector, v3:Vector)-> Vector:
    return([v1i+v2i-v3i for v1i,v2i,v3i in zip(v1,v2,v3)])

In [180]:
rest = np.dot(rot90(a),a)
rest

5

In [179]:
rest1 = mag(a)*mag(b)
rest1

38.3275357934736